Revit 2027 API
ExternalDataManagerCommands Class
Provides a container of all Revit built-in ExternalDataManagerCommandId instances.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ExternalDataManagerCommands
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ExternalDataManagerCommands
Public NotInheritable Class ExternalDataManagerCommands
public ref class ExternalDataManagerCommands abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternalDataManagerCommands = class end
See Also
Reference
Autodesk.Revit.UI Namespace